---
kind: type
id: T:Autodesk.Revit.DB.Macros.MacroModuleIterator
source: html/320b8746-c7b2-797a-6764-babdf0c79715.htm
---
# Autodesk.Revit.DB.Macros.MacroModuleIterator

An iterator to the Macros in a MacroModule.

## Syntax (C#)
```csharp
public class MacroModuleIterator : IEnumerator<Macro>
```